app/controllers/reviews_controller.rb

  def new
    @product = Product.find(params[:product_id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('Karen', 7, 'むっちゃいい！', 14, '2018-02-17 07:31:38', '2018-02-17 07:31:38')